app/results/confluence/2022-06-17_10-39-56/effective.yml
---
cli:
  linter:
    disable: false
    ignored-warnings: []
    lint-and-exit: false
    warn-on-unfamiliar-fields: false
cli-aliases:
  cloud:
    provisioning: cloud
  detach:
    modules:
      cloud:
        detach: true
  func:
    modules:
      console:
        disable: true
    settings:
      aggregator: functional-consolidator
  gui:
    modules:
      jmeter:
        gui: true
  install-tools:
    services:
    - install-checker
  lint:
    cli:
      linter:
        lint-and-exit: true
  local:
    provisioning: local
  locations:
    modules:
      cloud:
        dump-locations: true
    provisioning: cloud
  nolint:
    cli:
      linter:
        disable: true
  public:
    modules:
      blazemeter:
        public-report: true
  report:
    reporting:
    - blazemeter
  sequential:
    modules:
      local:
        sequential: true
execution:
- concurrency: '4'
  executor: jmeter
  hold-for: 15m
  ramp-up: 15s
  scenario: jmeter
- executor: selenium
  hold-for: 15m
  runner: pytest
  scenario: selenium
included-configs: []
install-id: Docker
modules:
  ab:
    class: bzt.modules.ab.ApacheBenchmarkExecutor
  android-emulator:
    class: bzt.modules.services.AndroidEmulatorLoader
  apiritif:
    class: bzt.modules._apiritif.ApiritifNoseExecutor
  appium:
    class: bzt.modules.services.AppiumLoader
  blazemeter:
    class: bzt.modules.blazemeter.BlazeMeterUploader
  capturehar:
    class: bzt.modules.blazemeter.ServiceStubCaptureHAR
  cloud:
    class: bzt.modules.blazemeter.CloudProvisioning
    default-location: us-central1-a
  console:
    class: bzt.modules.console.ConsoleStatusReporter
    disable: true
  consolidator:
    class: bzt.modules.aggregator.ConsolidatingAggregator
    percentiles: []
    rtimes-len: 0
  external-results-loader:
    class: bzt.modules.external.ExternalResultsLoader
  final-stats:
    class: bzt.modules.reporting.FinalStatus
  final_stats:
    class: bzt.modules.reporting.FinalStatus
  functional-consolidator:
    class: bzt.modules.functional.FunctionalAggregator
  gatling:
    class: bzt.modules.gatling.GatlingExecutor
    properties:
      gatling.data.file.bufferSize: 256
  install-checker:
    class: bzt.modules.services.InstallChecker
  jmeter:
    class: bzt.modules.jmeter.JMeterExecutor
    detect-plugins: true
    memory-xmx: 8G
    plugins:
    - jpgc-casutg
    - jpgc-dummy
    - jpgc-ffw
    - jpgc-fifo
    - jpgc-functions
    - jpgc-json
    - jpgc-perfmon
    - jpgc-prmctl
    - jpgc-tst
    - bzm-parallel=0.4
    - bzm-random-csv=0.6
    - jpgc-casutg=2.5
    - jpgc-dummy=0.2
    - jpgc-ffw=2.0
    - jpgc-fifo=0.2
    - jpgc-functions=2.1
    - jpgc-json=2.6
    - jpgc-perfmon=2.1
    - jpgc-prmctl=0.4
    - jpgc-tst=2.4
    - jpgc-wsc=0.3
    - tilln-sshmon=1.0
    - jpgc-synthesis=2.2
    properties:
      jmeter.save.saveservice.autoflush: 'true'
      jmeter.save.saveservice.connect_time: 'true'
      jmeterengine.force.system.exit: 'true'
      summariser.name: ''
    protocol-handlers:
      http: bzt.jmx.http.HTTPProtocolHandler
      mqtt: bzt.jmx.mqtt.MQTTProtocolHandler
    system-properties:
      httpsampler.ignore_failed_embedded_resources: 'true'
      java.rmi.server.hostname: localhost
      server.rmi.ssl.disable: true
    version: 5.4.2
  junit:
    class: bzt.modules.java.JUnitTester
  junit-xml:
    class: bzt.modules.reporting.JUnitXMLReporter
  k6:
    class: bzt.modules.k6.K6Executor
  local:
    class: bzt.modules.provisioning.Local
  locust:
    class: bzt.modules._locustio.LocustIOExecutor
  mocha:
    class: bzt.modules.javascript.MochaTester
  molotov:
    class: bzt.modules._molotov.MolotovExecutor
  monitoring:
    class: bzt.modules.monitoring.Monitoring
  newman:
    class: bzt.modules.javascript.NewmanExecutor
  nunit:
    class: bzt.modules.csharp.NUnitExecutor
  passfail:
    class: bzt.modules.passfail.PassFailStatus
  pip-install:
    class: bzt.modules.services.PipInstaller
  proxy2jmx:
    class: bzt.modules.proxy2jmx.Proxy2JMX
  pytest:
    class: bzt.modules._pytest.PyTestExecutor
  robot:
    class: bzt.modules.robot.RobotExecutor
  rspec:
    class: bzt.modules.ruby.RSpecTester
  screenshoter:
    class: bzt.modules.blazemeter.ServiceStubScreenshoter
  selenium:
    chromedriver:
      version: 102.0.5005.61
    class: bzt.modules._selenium.SeleniumExecutor
  shellexec:
    class: bzt.modules.shellexec.ShellExecutor
  siege:
    class: bzt.modules.siege.SiegeExecutor
  testng:
    class: bzt.modules.java.TestNGTester
  tsung:
    class: bzt.modules.tsung.TsungExecutor
  unpacker:
    class: bzt.modules.services.Unpacker
  vegeta:
    class: bzt.modules.vegeta.VegetaExecutor
  virtual-display:
    class: bzt.modules.services.VirtualDisplay
  wdio:
    class: bzt.modules.javascript.WebdriverIOExecutor
  xunit:
    class: bzt.modules.csharp.XUnitExecutor
provisioning: local
reporting:
- module: final-stats
- module: console
- data-source: sample-labels
  module: junit-xml
scenarios:
  jmeter:
    properties:
      application_hostname: smart-loadb-1ttcyotqpvugn-224508294.us-east-1.elb.amazonaws.com
      application_port: '80'
      application_postfix: ''
      application_protocol: http
      perc_comment_page: '6'
      perc_create_and_edit_page: '7'
      perc_create_blog: '3'
      perc_like_page: '2'
      perc_search_cql: '9'
      perc_standalone_extension: '0'
      perc_upload_attachment: '5'
      perc_view_attachment: '4'
      perc_view_blog: '10'
      perc_view_dashboard: '8'
      perc_view_page: '46'
      total_actions_per_hr: '2000'
    script: jmeter/confluence.jmx
  locust:
    script: locustio/confluence/locustfile.py
  selenium:
    script: selenium_ui/confluence_ui.py
services:
- local:
  - metrics:
    - cpu
    - mem
    - bytes-sent
    - bytes-recv
    - disk-read
    - disk-write
    - disk-space
    - engine-loop
    - conn-all
  module: monitoring
- module: shellexec
  post-process:
  - command: python util/analytics/analytics.py confluence
  - command: python util/post_run/cleanup_results_dir.py
  prepare:
  - command: python util/pre_run/environment_checker.py
  - command: python util/pre_run/check_for_updates.py
  - command: python util/data_preparation/confluence_prepare_data.py
  shutdown:
  - command: python util/post_run/jmeter_post_check.py
  - command: python util/jtl_convertor/jtls-to-csv.py kpi.jtl selenium.jtl
- module: pip-install
  packages:
  - selenium==4.1.3
settings:
  aggregator: consolidator
  artifacts-dir: results/confluence/%Y-%m-%d_%H-%M-%S
  check-updates: false
  default-executor: jmeter
  env:
    JMETER_VERSION: 5.4.2
    LANGUAGE: en_US.utf8
    OBJC_DISABLE_INITIALIZE_FORK_SAFETY: 'YES'
    TAURUS_ARTIFACTS_DIR: /dc-app-performance-toolkit/app/results/confluence/2022-06-17_10-39-56
    WEBDRIVER_VISIBLE: 'False'
    admin_login: admin
    admin_password: '********'
    allow_analytics: 'True'
    application_hostname: smart-loadb-1ttcyotqpvugn-224508294.us-east-1.elb.amazonaws.com
    application_port: '80'
    application_postfix: null
    application_protocol: http
    comment_page: '6'
    concurrency: '4'
    create_and_edit_page: '7'
    create_blog: '3'
    custom_dataset_query: null
    like_page: '2'
    load_executor: jmeter
    ramp-up: 15s
    search_cql: '9'
    secure: 'False'
    standalone_extension: '0'
    test_duration: 15m
    total_actions_per_hour: '2000'
    upload_attachment: '5'
    view_attachment: '4'
    view_blog: '10'
    view_dashboard: '8'
    view_page: '46'
  verbose: false
version: 1.16.3